darren1713/elua/src/platform/sim3u1xx/platform.c
void watchdog_counter_set( u16 value )
{
  wdt_reset_counter = value;
}

void WDTIMER0_IRQHandler(void)
{
  u8 rng_tmp, rng_drain;
    if ((SI32_WDTIMER_A_is_early_warning_interrupt_pending(SI32_WDTIMER_0) &
        SI32_WDTIMER_A_is_early_warning_interrupt_enabled(SI32_WDTIMER_0)))
    {
      if( wdt_reset_counter > 0 )
      {
        SI32_WDTIMER_A_reset_counter( SI32_WDTIMER_0 );
        SI32_WDTIMER_A_clear_early_warning_interrupt( SI32_WDTIMER_0 );

        wdt_reset_counter--;
      }

      cur_wdt_time = platform_timer_read( PLATFORM_TIMER_SYS_ID );
      rng_tmp = platform_timer_get_diff_us( PLATFORM_TIMER_SYS_ID, last_wdt_time, cur_wdt_time ) % 256;

      if( buf_is_enabled( BUF_ID_RNG, 0 ) )
      {
        // Burn off old entropy if unused
        if( buf_get_count( BUF_ID_RNG, 0 ) == buf_get_size( BUF_ID_RNG, 0 ) )
          buf_read(BUF_ID_RNG, 0, ( t_buf_data* )&rng_drain );

        buf_write(BUF_ID_RNG, 0, ( t_buf_data* )&rng_tmp );
      }

      last_wdt_time = cur_wdt_time;

    }
}

#if defined( BUILD_USB_CDC )
unsigned console_cdc_active = 0;
#endif



// SiM3 SystemInit calls this function, disable watchdog timer
void mySystemInit(void)
{
  // Setup Watchdog Timer
  SI32_WDTIMER_A_stop_counter(SI32_WDTIMER_0);

  // enable APB clock to the Port Bank module
  SI32_CLKCTRL_A_enable_apb_to_modules_0 (SI32_CLKCTRL_0, SI32_CLKCTRL_A_APBCLKG0_PB0CEN_MASK);
  // make the SWO pin (PB1.3) push-pull to enable SWV printf
  //SI32_PBSTD_A_set_pins_push_pull_output (SI32_PBSTD_1, (1<<3));

}

#if defined( ELUA_BOARD_GSATMICRO_V10 ) || defined( ELUA_BOARD_GSATMICRO_V8 ) || defined( ELUA_BOARD_GSATMICRO_V7 )

int usb_power()
{
  return ( int )SI32_VREG_A_is_vbus_valid( SI32_VREG_0 );
}

int external_power()
{
  //check USB DC 3.9 or HVDC 3.8
  if( ( SI32_PBSTD_A_read_pins( PIN_HV_BANK ) & ( PIN_HV_PIN ) ) ||
      ( usb_power() ) )
    return 1;
  else
    return 0;
}

int external_buttons()
{
#if defined( PCB_V7 ) || defined( PCB_V8 ) || defined( PCB_V10 )
  //check inputs 1 and 2
  if( ( SI32_PBSTD_A_read_pins( SI32_PBSTD_2 ) & ( 1 << 2 ) ) ||
      ( SI32_PBSTD_A_read_pins( SI32_PBSTD_2 ) & ( 1 << 3 ) ) ||
      ( SI32_PBSTD_A_read_pins( SI32_PBSTD_2 ) & ( 1 << 4 ) ) )
    return 1;
  else
    return 0;
#else
  //check inputs 1 and 2
  if( /*( SI32_PBSTD_A_read_pins( SI32_PBSTD_3 ) & ( 1 << 6 ) ) ||*/
      ( SI32_PBSTD_A_read_pins( SI32_PBSTD_0 ) & ( 1 << 1 ) ) )
    return 1;
  else
    return 0;
#endif
}
int external_io_check()
{
  int ret = 0;
#if defined( PCB_V7 ) || defined( PCB_V8 ) || defined( PCB_V10 )
  if(rram_read_bit(RRAM_BIT_WAKE_ON_INPUT1) == WAKE_ON_INPUT1_ACTIVE)
  {
    int val = adc_get_single_sample( 0 );
    if( val >= 0 )
    {
      if(rram_read_bit(RRAM_BIT_WAKE_ON_INPUT1_POLARITY) == WAKE_ON_INPUT1_POLARITY_POSITIVE)
      {
        if(val > 2500 && rram_read_bit( RRAM_BIT_INPUT1_LAST_STATE ) ==  INPUT1_LAST_STATE_LOW)
        {
          rram_write_bit(RRAM_BIT_INPUT1_TRIGGERED, INPUT1_TRIGGERED);
          ret = 1;
        }
      } else {
        if(val < 800 && rram_read_bit( RRAM_BIT_INPUT1_LAST_STATE ) ==  INPUT1_LAST_STATE_HIGH)
        {
          rram_write_bit(RRAM_BIT_INPUT1_TRIGGERED, INPUT1_TRIGGERED);
          ret = 1;
        }
      }

      if( val > 2500 )
        rram_write_bit(RRAM_BIT_INPUT1_LAST_STATE, INPUT1_LAST_STATE_HIGH);
      if( val < 800 )
        rram_write_bit(RRAM_BIT_INPUT1_LAST_STATE, INPUT1_LAST_STATE_LOW);
    }

  }
  if(rram_read_bit(RRAM_BIT_WAKE_ON_INPUT2) == WAKE_ON_INPUT2_ACTIVE)
  {
    int val = adc_get_single_sample( 1 );
    if( val >= 0 )
    {
      if(rram_read_bit(RRAM_BIT_WAKE_ON_INPUT2_POLARITY) == WAKE_ON_INPUT2_POLARITY_POSITIVE)
      {
        if(val > 2500 && rram_read_bit( RRAM_BIT_INPUT2_LAST_STATE ) ==  INPUT2_LAST_STATE_LOW)
        {
          rram_write_bit(RRAM_BIT_INPUT2_TRIGGERED, INPUT2_TRIGGERED);
          ret = 1;
        }
      } else {
        if(val < 800 && rram_read_bit( RRAM_BIT_INPUT2_LAST_STATE ) ==  INPUT2_LAST_STATE_HIGH)
        {
          rram_write_bit(RRAM_BIT_INPUT2_TRIGGERED, INPUT2_TRIGGERED);
          ret = 1;
        }
      }

      if( val > 2500 )
        rram_write_bit(RRAM_BIT_INPUT2_LAST_STATE, INPUT2_LAST_STATE_HIGH);
      if( val < 800 )
        rram_write_bit(RRAM_BIT_INPUT2_LAST_STATE, INPUT2_LAST_STATE_LOW);
    }
  }
#endif
  return ret;
}

int external_io()
{
  return ( rram_read_bit(RRAM_BIT_INPUT2_TRIGGERED) == INPUT2_TRIGGERED ) || 
         ( rram_read_bit(RRAM_BIT_INPUT1_TRIGGERED) == INPUT1_TRIGGERED );
}


int bluetooth_connected()
{
#if defined( BLUETOOTH_ENABLE_TDI_DTR )
  if( ( rram_read_bit(RRAM_BIT_BLUETOOTH_WAKE) == BLUETOOTH_WAKE_ACTIVE ) &&
      ( platform_pio_op( 1, 1 << 4, PLATFORM_IO_PIN_GET ) ) )
    return 1;
#endif
  return 0;
}


#endif
static int pmu_wake_status = -1;
static int pmu_status = -1;
static int reset_status = -1;
void reset_parameters()
{
  int i;
  for(i=0;i<8;i++)
  {
    rram_write_int(i, 0);
  }
}

void wake_init( void )
{
#if defined( ELUA_BOARD_GSATMICRO_V10 ) || defined( ELUA_BOARD_GSATMICRO_V8 ) || defined( ELUA_BOARD_GSATMICRO_V7 )

  //Determine if we had a power failure, voltage dropout, or reset button pressed
  //The pre-generated code for SI32_RSTSRC_A_get_last_reset_source is incorrect and does
  //not take into account PORRF. Also, these registers MUST be read in order PORRF, VMONRF, PINRF
  //as the remainder are invalid if the previous one is set. See table 6.2.

  // Wake from PM9
  if((pmu_status & SI32_PMU_A_STATUS_PM9EF_MASK) == SI32_PMU_A_STATUS_PM9EF_SET_U32)
  {
    //Check for reset pin while in PM9
    if((pmu_wake_status & SI32_PMU_A_WAKESTATUS_RSTWF_MASK) == SI32_PMU_A_WAKESTATUS_RSTWF_SET_U32)
    {
      reset_parameters();
      wake_reason = WAKE_RESETPIN;
    }
    else if((pmu_status & SI32_PMU_A_STATUS_PWAKEF_MASK) == (0 << SI32_PMU_A_STATUS_PWAKEF_SHIFT)) //Check for pin wake NOTE: SiLabs headers are wrong, this bit is backwards per the manual...
    {
      if( bluetooth_connected() )
      {
        wake_reason = WAKE_BLUETOOTH;
      }
      else if( external_power() )
      {
        wake_reason = WAKE_POWERCONNECTED;
      }
      else
      {
        wake_reason = WAKE_WAKEPIN;
      }

      if( rram_read_bit( RRAM_BIT_TEMP_STORAGE_MODE ) == TEMP_STORAGE_MODE_ACTIVE )
      {
        if( !external_power() && ( bat_abovethresh() < 1 ) )
        {
          rram_write_int( RRAM_INT_SLEEPTIME, SLEEP_FOREVER ); //will wakeup in 68 years
        }
        else
        {
          // If external power, clear bat preservation mode
          rram_write_bit( RRAM_BIT_TEMP_STORAGE_MODE, TEMP_STORAGE_MODE_DISABLED );
          rram_write_int( RRAM_INT_SLEEPTIME, 0 );

