darren1713/elua/src/platform/sim3u1xx/platform.c
        }
      }
      //Put the remaining sleep time back into rram_reg[0]
      else if( ( rram_read_bit(RRAM_BIT_POWEROFF) == POWEROFF_MODE_ACTIVE ) &&
               ( rram_read_bit(RRAM_BIT_CHECKIN) == CHECKIN_MODE_DISABLED ) &&
               ( rram_read_bit(RRAM_BIT_ALERT) == ALERT_MODE_DISABLED ) &&
               ( rram_read_bit(RRAM_BIT_ALERT_SINGLE ) == ALERT_MODE_SINGLE_DISABLED ) )
      {
        rram_write_int(RRAM_INT_SLEEPTIME, SLEEP_FOREVER); //will wakeup in 68 years
      }
      else if( ( rram_read_bit(RRAM_BIT_STORAGE_MODE) == STORAGE_MODE_ACTIVE ) &&
               ( rram_read_bit(RRAM_BIT_CHECKIN) == CHECKIN_MODE_DISABLED ) &&
               ( rram_read_bit(RRAM_BIT_ALERT) == ALERT_MODE_DISABLED ) &&
               ( rram_read_bit(RRAM_BIT_ALERT_SINGLE ) == ALERT_MODE_SINGLE_DISABLED ) )
      {
        //Sleep forever, in storage mode. Power button will wakeup device
        rram_write_int(RRAM_INT_SLEEPTIME, SLEEP_FOREVER); //will wakeup in 68 years
      }
      else
        rram_write_int(RRAM_INT_SLEEPTIME, rram_read_int(RRAM_INT_SLEEPTIME) + rtc_remaining);


#ifdef EXTRA_SLEEP_HOOK
      //pass negative time to notify early wakeup
      //extras_sleep_hook(rtc_remaining * -1);
#endif

      //Don't auto-sleep for some period of seconds
      sleep_delay = 5;
    }
    // Not a pin wake or reset pin
    else
    {
      if( rram_read_bit( RRAM_BIT_TEMP_STORAGE_MODE) == TEMP_STORAGE_MODE_ACTIVE )
      {
        if( !external_power() && ( bat_abovethresh() < 1 ) )
        {
          rram_write_int( RRAM_INT_SLEEPTIME, SLEEP_FOREVER ); //will wakeup in 68 years
        }
        else
        {
          // If external power, clear bat preservation mode
          rram_write_bit( RRAM_BIT_TEMP_STORAGE_MODE, TEMP_STORAGE_MODE_DISABLED );
          rram_write_int( RRAM_INT_SLEEPTIME, 0 );
        }
      }
      else if( ( rram_read_bit(RRAM_BIT_POWEROFF) == POWEROFF_MODE_ACTIVE ) &&
               ( rram_read_bit(RRAM_BIT_CHECKIN) == CHECKIN_MODE_DISABLED ) &&
               ( rram_read_bit(RRAM_BIT_ALERT) == ALERT_MODE_DISABLED ) &&
               ( rram_read_bit(RRAM_BIT_ALERT_SINGLE ) == ALERT_MODE_SINGLE_DISABLED ) )
      {
        rram_write_int(RRAM_INT_SLEEPTIME, SLEEP_FOREVER); //will wakeup in 68 years
      }
      else if( ( rram_read_bit(RRAM_BIT_STORAGE_MODE) == STORAGE_MODE_ACTIVE ) &&
               ( rram_read_bit(RRAM_BIT_CHECKIN) == CHECKIN_MODE_DISABLED ) &&
               ( rram_read_bit(RRAM_BIT_ALERT) == ALERT_MODE_DISABLED ) &&
               ( rram_read_bit(RRAM_BIT_ALERT_SINGLE ) == ALERT_MODE_SINGLE_DISABLED ) )
      {
        //Sleep forever, in storage mode. Power button will wakeup device
        rram_write_int(RRAM_INT_SLEEPTIME, SLEEP_FOREVER); //will wakeup in 68 years
      }

      if( external_power() )
      {
        //Continue on as normal. The timer will count down rram_reg and execute
        //the appropriate script when it reaches zero
        wake_reason = WAKE_POWERCONNECTED;
      }
      else if( bluetooth_connected() )
      {
        wake_reason = WAKE_BLUETOOTH;
        //Don't auto-sleep for some period of seconds
        sleep_delay = 2;
      }
      else if( external_buttons() )
      {
        wake_reason = WAKE_WAKEPIN;
      }
      else if( external_io_check() )
      {
        wake_reason = WAKE_IO;
        //Don't auto-sleep for some period of seconds
        sleep_delay = 5;
      }
      else if( rram_read_int(RRAM_INT_SLEEPTIME) > 0 )  //Go back to sleep if we woke from a PMU wakeup
      {
        sim3_pmu_pm9( rram_read_int(RRAM_INT_SLEEPTIME) );
        wake_reason = WAKE_RTC;
      }
    }
  }
  // Wake sources other than PM9
  else if (((reset_status & SI32_RSTSRC_A_RESETFLAG_PORRF_MASK) == SI32_RSTSRC_A_RESETFLAG_PORRF_SET_U32)
    ||  ((reset_status & SI32_RSTSRC_A_RESETFLAG_VMONRF_MASK) == SI32_RSTSRC_A_RESETFLAG_VMONRF_SET_U32)
    ||  ((reset_status & SI32_RSTSRC_A_RESETFLAG_PINRF_MASK) == SI32_RSTSRC_A_RESETFLAG_PINRF_SET_U32)
    ||  ((pmu_status & SI32_PMU_A_STATUS_PORF_MASK) == SI32_PMU_A_STATUS_PORF_SET_U32)
    ||  ((pmu_wake_status & SI32_PMU_A_WAKESTATUS_RSTWF_MASK) == SI32_PMU_A_WAKESTATUS_RSTWF_SET_U32)
    ||  ((reset_status & SI32_RSTSRC_A_RESETFLAG_WDTRF_MASK) == SI32_RSTSRC_A_RESETFLAG_WDTRF_SET_U32) )
  {
    if((pmu_wake_status & SI32_PMU_A_WAKESTATUS_RSTWF_MASK) == SI32_PMU_A_WAKESTATUS_RSTWF_SET_U32)
      wake_reason = WAKE_RESETPIN;
    if((reset_status & SI32_RSTSRC_A_RESETFLAG_WDTRF_MASK) == SI32_RSTSRC_A_RESETFLAG_WDTRF_SET_U32)
      wake_reason = WAKE_WATCHDOG;
    else if((pmu_status & SI32_PMU_A_STATUS_PWAKEF_MASK) == 0) //Check for pin wake NOTE: SiLabs headers are wrong, this bit is backwards per the manual...
      wake_reason = WAKE_WAKEPIN;
    else
      wake_reason = WAKE_POWERUP;

    reset_parameters();
  }

#endif
}


int platform_init()
{
  int i;
  SystemInit();

  // Setup peripherals
  // platform_setup_timers();
  SI32_VREG_A_enable_band_gap(SI32_VREG_0);
  SI32_VREG_A_exit_suspend_mode(SI32_VREG_0);

  // Peripheral Clocking setup
  clk_init();

  //Set flash read speed to slow
#if defined( LOW_SYSTEM_CLOCK )
  SI32_FLASHCTRL_A_select_flash_read_time_slow(SI32_FLASHCTRL_0);
#endif

  SI32_PMU_A_clear_pmu_level_shifter_hold(SI32_PMU_0);
  pmu_status = SI32_PMU_0->STATUS.U32;
  pmu_wake_status = SI32_PMU_0->WAKESTATUS.U32;
  reset_status = SI32_RSTSRC_0->RESETFLAG.U32;
  SI32_PMU_A_clear_pin_level_shifter_hold(SI32_PMU_0);
  SI32_PMU_A_clear_wakeup_flags(SI32_PMU_0);
  SI32_PMU_A_clear_por_flag(SI32_PMU_0);

  // GPIO setup
  pios_init();

  // System timer setup
  cmn_systimer_set_base_freq( cmsis_get_cpu_frequency() );
  cmn_systimer_set_interrupt_freq( SYSTICKHZ );

  // Enable SysTick
  SysTick_Config( cmsis_get_cpu_frequency() / SYSTICKHZ );

  // RTC Configuration
  SI32_RTC_A_start_timer_capture(SI32_RTC_0);
  while(SI32_RTC_A_is_timer_capture_in_progress(SI32_RTC_0));

  rtc_remaining = (SI32_RTC_A_read_alarm0(SI32_RTC_0)-SI32_RTC_A_read_setcap(SI32_RTC_0))/platform_timer_op(0, PLATFORM_TIMER_OP_GET_CLOCK, 0);
  rtc_init();

  // __NVIC_PRIO_BITS = 4 so there are 16 priorities. It seems as though the first bit is not used as SPI1 has to be set 2 lower than systick?

  uint32_t priorityGroup;
  // Configure the NVIC Preemption Priority Bits
  // Set all bits to preempt priority
  NVIC_SetPriorityGrouping(0x03);
  priorityGroup =  NVIC_GetPriorityGrouping();
 
  NVIC_SetPriority(SysTick_IRQn, NVIC_EncodePriority(priorityGroup, 3, 0));
  
//  NVIC_SetPriority(SysTick_IRQn, 2);
  for(i=WDTIMER0_IRQn;i<=VREG0LOW_IRQn;i++)
  {
    switch(i)
    {
      case WDTIMER0_IRQn:
        NVIC_SetPriority(i, NVIC_EncodePriority(priorityGroup, 0, 0));
//        NVIC_SetPriority(i, (1 << __NVIC_PRIO_BITS) - 6);
        break;
      case I2C0_IRQn:
#if defined(BUILD_SPI1)
      case SPI1_IRQn:
#endif
        NVIC_SetPriority(i, NVIC_EncodePriority(priorityGroup, 1, 0));
        //NVIC_SetPriority(i, 0);
        break;
      case UART0_IRQn:
      case UART1_IRQn:
      case USB0_IRQn:
      case USART0_IRQn:
      case USART1_IRQn:
      case EPCA0_IRQn:
        NVIC_SetPriority(i, NVIC_EncodePriority(priorityGroup, 2, 0));
//        NVIC_SetPriority(i, (1 << __NVIC_PRIO_BITS) - 4);
        break;
      case TIMER1L_IRQn:
      case TIMER1H_IRQn:
        NVIC_SetPriority(i, NVIC_EncodePriority(priorityGroup, 4, 0));
//        NVIC_SetPriority(i, (1 << __NVIC_PRIO_BITS) - 3);
        break;
      case TIMER0L_IRQn:
      case TIMER0H_IRQn:
        NVIC_SetPriority(i, NVIC_EncodePriority(priorityGroup, 5, 0));
//        NVIC_SetPriority(i, (1 << __NVIC_PRIO_BITS) - 2);
        break;
      default:
        NVIC_SetPriority(i, NVIC_EncodePriority(priorityGroup, 6, 0));
//        NVIC_SetPriority(i, (1 << __NVIC_PRIO_BITS) - 1);
        break;
    }
  }

  // Enable Timer 0
  gTIMER0_enter_auto_reload_config();
  // Enable Timer 1
  gTIMER1_enter_auto_reload_config();


  buf_set( BUF_ID_RNG, 0, BUF_SIZE_32, BUF_DSIZE_U8 );

  // Setup Watchdog Timer
  SI32_WDTIMER_A_stop_counter(SI32_WDTIMER_0);
  SI32_WDTIMER_A_reset_counter (SI32_WDTIMER_0);
  while(SI32_WDTIMER_A_is_threshold_update_pending(SI32_WDTIMER_0));
  SI32_WDTIMER_A_set_early_warning_threshold (SI32_WDTIMER_0, PLATFORM_EARLY_WARNING_THRESHOLD);
  while(SI32_WDTIMER_A_is_threshold_update_pending(SI32_WDTIMER_0));
  SI32_WDTIMER_A_set_reset_threshold (SI32_WDTIMER_0, PLATFORM_RESET_THRESHOLD);

