darren1713/elua/src/platform/sim3u1xx/platform.c
static u8 seconds_tick_pending = 0;
void TIMER0H_IRQHandler(void)
{
#if defined( BUILD_USB_CDC )
  usb_pcb_t *pcb = usb_pcb_get();
  //Check if USB is powered. It will not actually TX/RX unless enumerated though
  if( SI32_VREG_A_is_vbus_valid( SI32_VREG_0 ) )
  {
    if( pcb->connected == false )
    {
      SI32_USB_A_enable_internal_pull_up( SI32_USB_0 );
    }
    console_cdc_active = 1;
    pcb->connected = true;
  }
  else
  {
    if( pcb->connected == true )
    {
      SI32_USB_A_suspend_usb_oscillator( SI32_USB_0 );
      SI32_USB_A_disable_internal_pull_up( SI32_USB_0 );
    }
    console_cdc_active = 0;
    pcb->connected = false;
    pcb->flags = 0;
  }

  usb_poll();
#endif

#if defined( INT_SYSTICK )
  cmn_int_handler( INT_SYSTICK, 0 );
#endif


  if(seconds_tick_pending)
  {
    SecondsTick_Handler();
    seconds_tick_pending = 0;
  }

  // Clear the interrupt flag
  SI32_TIMER_A_clear_high_overflow_interrupt(SI32_TIMER_0);
}

#if 0 //!defined(PCB_V10)
//NOTE! These must be sized by a factor of 2 to calculate properly
//First byte is size of the array
#define LED_COUNT 5
#define LED_MAX_ARRAY 32

static u8 const CLED_FADEUP[] = { LED_MAX_ARRAY/2, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0 };
static u8 const CLED_FADEDOWN[] = { LED_MAX_ARRAY/2, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15 };
static u8 const CLED_OFF[] = { 1, 15 };
static u8 const CLED_ON[] = { 1, 0 };
static u8 const CLED_FASTFLASH[] = { LED_MAX_ARRAY/4, 0, 15, 15, 15, 15, 15, 15, 15 };
static u8 const CLED_MEDIUMFLASH[] = { LED_MAX_ARRAY/2, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15 };
static u8 const CLED_SLOWFLASH[] = { LED_MAX_ARRAY, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};
static u8 const CLED_FLASH1[] = { LED_MAX_ARRAY, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};
static u8 const CLED_FLASH2[] = { LED_MAX_ARRAY, 0, 15, 15, 15,  0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};
static u8 const CLED_FLASH3[] = { LED_MAX_ARRAY, 0, 15, 15, 15,  0, 15, 15, 15,  0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};
static u8 const CLED_FLASH4[] = { LED_MAX_ARRAY, 0, 15, 15, 15,  0, 15, 15, 15,  0, 15, 15, 15,  0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};
static u8 const CLED_FLASH5[] = { LED_MAX_ARRAY, 0, 15, 15, 15,  0, 15, 15, 15,  0, 15, 15, 15,  0, 15, 15, 15,  0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};

static u8 const * led_cled_ptr[] = {
  CLED_FADEUP,
  CLED_FADEDOWN,
  CLED_OFF,
  CLED_ON,
  CLED_FASTFLASH,
  CLED_MEDIUMFLASH,
  CLED_SLOWFLASH,
  CLED_FLASH1,
  CLED_FLASH2,
  CLED_FLASH3,
  CLED_FLASH4,
  CLED_FLASH5
};

#define LEDTICKHZ 1000
#define LEDTICK_DIVIDER 2
u8 led_pointer_tick = 0;
u8 led_tick = 0;
u8 led_repeat_tick = 0;
u8 led_divider_tick = 0;

u8 led_ticks = 0;

u8 led_ticks_ptr[LED_COUNT] = { 0, 0, 0, 0, 0 };
u8 led_background[LED_COUNT] = { 0, 0, 0, 0, 0 };

#define LED_REPEATS_FOREVER 255

//u8 * led_mode_ptr[] = { CLED_FADEDOWN, CLED_FADEUP, CLED_FASTFLASH, CLED_SLOWFLASH, CLED_MEDIUMFLASH };
//u8 led_repeats_ptr[LED_COUNT] = { 10, 10, 10, 10, 10 };

u8 * led_mode_ptr[] = { (u8 *)CLED_OFF, (u8 *)CLED_OFF, (u8 *)CLED_OFF, (u8 *)CLED_OFF, (u8 *)CLED_OFF };
u8 led_repeats_ptr[LED_COUNT] = { 10, 10, 10, 10, 10 };

//Pending variables here...wait for new "frame"
u8 * led_pending_mode_ptr[LED_COUNT] = { NULL, NULL, NULL, NULL, NULL };
u8 led_pending_repeats_ptr[LED_COUNT] = { 0, 0, 0, 0, 0 };

u8 led_mask = 0x00;

#if defined( PCB_V8 ) || defined( PCB_V10 )
#define LED_PORT 0
#else
#define LED_PORT 2
#endif

#if defined( PCB_V7 ) || defined( PCB_V8 )
#define MLED_PIN_0 4
#define MLED_PIN_1 5
#define MLED_PIN_2 6
#define MLED_PIN_3 7
#define MLED_PIN_4 8
#define MLED_PIN_5 9
#elif defined( PCB_V10 )
#define MLED_PIN_0 8
#define MLED_PIN_1 9
#define MLED_PIN_2 10
#define MLED_PIN_3 11
#define MLED_PIN_4 12
#define MLED_PIN_5 13
#endif

void TIMER1H_IRQHandler(void)
{
  led_ticks=((led_ticks+1) & 0x0F);
  if(!led_ticks)
  {
    if(led_pointer_tick == 3)
    {
      led_pointer_tick = 0;

      //load next values here
      if(led_repeat_tick == 0)
      {
        led_repeat_tick = 0;

        int lednum;
        for(lednum=0;lednum<LED_COUNT;lednum++)
        {
          if(led_pending_mode_ptr[lednum] != NULL)
          {
            led_mode_ptr[lednum] = led_pending_mode_ptr[lednum];
            led_repeats_ptr[lednum] = led_pending_repeats_ptr[lednum];
            led_pending_mode_ptr[lednum] = NULL;
            led_pending_repeats_ptr[lednum] = 0;
          }
        }
      }

      int lednum;
      if( led_divider_tick == 0 )
      {
        for(lednum=0;lednum<LED_COUNT;lednum++)
        {
          if(led_repeats_ptr[lednum] > 0)
          {
            if((led_repeats_ptr[lednum] != LED_REPEATS_FOREVER) && ((led_tick % led_mode_ptr[lednum][0]) == 0))
              led_repeats_ptr[lednum]--;
            if(led_repeats_ptr[lednum] > 0)
              led_ticks_ptr[lednum] = led_mode_ptr[lednum][(led_tick % led_mode_ptr[lednum][0])+1];
          }
        }
        led_tick++;
        led_repeat_tick = (led_repeat_tick+1) % LED_MAX_ARRAY;
      }
      led_divider_tick++;
      led_divider_tick %= LEDTICK_DIVIDER;
    }
    led_pointer_tick++;
  }
  else
  {
    if(led_ticks + led_background[0] > led_ticks_ptr[0] && (led_mask & 1 ) )
      SI32_PBSTD_A_write_pins_high( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_1 ) );
    else
      SI32_PBSTD_A_write_pins_low( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_1 ) );
    if(led_ticks + led_background[1] > led_ticks_ptr[1] && (led_mask & 1<<1 ) )
    {
      SI32_PBSTD_A_write_pins_high( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_2 ) );
    #if !defined( MEMBRANE_V1)
    #if defined( PCB_V8 ) || defined( PCB_V10 )
      SI32_PBSTD_A_write_pins_high( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_0 ) );
    #else
      SI32_PBHD_A_write_pins_high( SI32_PBHD_4, ( ( u32 ) 1 << 3 ) );
    #endif
    #endif
    }
    else
    {
      SI32_PBSTD_A_write_pins_low( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_2 ) );
    #if !defined( MEMBRANE_V1)
    #if defined( PCB_V8 ) || defined( PCB_V10 )
      SI32_PBSTD_A_write_pins_low( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_0 ) );
    #else
      SI32_PBHD_A_write_pins_low( SI32_PBHD_4, ( ( u32 ) 1 << 3 ) );
    #endif
    #endif
    }
    if(led_ticks + led_background[2] > led_ticks_ptr[2] && (led_mask & 1<<2 ) )
    {
    #if defined( MEMBRANE_V1)
    #if defined( PCB_V8 ) || defined( PCB_V10 )
      SI32_PBSTD_A_write_pins_high( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_0 ) );
    #else
      SI32_PBHD_A_write_pins_high( SI32_PBHD_4, ( ( u32 ) 1 << 3 ) );
    #endif
    #endif
      SI32_PBSTD_A_write_pins_high( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_3 ) );
    }
    else
    {
    #if defined( MEMBRANE_V1)
    #if defined( PCB_V8 ) || defined( PCB_V10 )
      SI32_PBSTD_A_write_pins_low( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_0 ) );
    #else
      SI32_PBHD_A_write_pins_low( SI32_PBHD_4, ( ( u32 ) 1 << 3 ) );
    #endif
    #endif
      SI32_PBSTD_A_write_pins_low( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_3 ) );
    }
    if(led_ticks + led_background[3] > led_ticks_ptr[3] && (led_mask & 1<<3 ) )
      SI32_PBSTD_A_write_pins_high( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_4 ) );
    else
      SI32_PBSTD_A_write_pins_low( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_4 ) );
    if(led_ticks + led_background[4] > led_ticks_ptr[4] && (led_mask & 1<<4 ) )
      SI32_PBSTD_A_write_pins_high( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_5 ) );
    else
      SI32_PBSTD_A_write_pins_low( port_std[ LED_PORT ], ( ( u32 ) 1 << MLED_PIN_5 ) );
  }
  // Clear the interrupt flag
  SI32_TIMER_A_clear_high_overflow_interrupt(SI32_TIMER_1);
}

void led_cache_mode(int led, int mode )
{
  u8 rram_led_byte = rram_read_byte(4);
  if( led == LED_COLOR_GPS )
  {
    rram_led_byte &= ~0xF;
    rram_led_byte |= (mode & 0xF);
  }
  if( led == LED_COLOR_SAT )
  {
    rram_led_byte &= ~0xF0;
    rram_led_byte |= ( ( mode << 4 ) & 0xF0);
  }
  rram_write_byte(4, rram_led_byte);
  //printf("CACHING_LED: 0x%x, %d, %d\n", rram_led_byte, led, mode);
}

void led_set_mask( u8 mask )
{
#if defined ( MEMBRANE_V1 )
  led_mask = mask;
#else
  // Module Board LED numbers
  led_mask = 0;
  led_mask |= ( ( mask & 1 ) << 3 ); // GPS
  led_mask |= ( ( mask & (1 << 1) ) << 3 ); // MSG
  led_mask |= ( ( mask & (1 << 2) ) >> 1 ); // PWR
  led_mask |= ( ( mask & (1 << 3) ) >> 3 ); // SAT
  led_mask |= ( ( mask & (1 << 4) ) >> 2 ); // ALRM
#endif
}

void led_set_background(int led, u8 bkgnd)
{
  if(led > LED_COUNT)
    return;
  if(bkgnd > 15)
    bkgnd = 15;

  led_background[led]  = bkgnd;
}

void led_set_mode(int led, int mode, int cycles)
{
  if(led > LED_COUNT)
    return;
  if(cycles > 255)
    cycles = 255;
  led_pending_mode_ptr[led] = (u8 *)led_cled_ptr[mode];
  led_pending_repeats_ptr[led] = cycles;
}

int led_get_mode(int led)
{
  if(led > LED_COUNT)
    return -1;

