darren1713/elua/src/platform/sim3u1xx/platform.c
  int i;
  if(led_pending_mode_ptr[led] != NULL)
  {
    for(i=0;i<( sizeof( led_cled_ptr ) / sizeof( led_cled_ptr[0] ) );i++)
    {
      if(led_pending_mode_ptr[led] == led_cled_ptr[i])
        return i;
    }
  } else {
    for(i=0;i<( sizeof( led_cled_ptr ) / sizeof( led_cled_ptr[0] ) );i++)
    {
      if(led_mode_ptr[led] == led_cled_ptr[i])
        return i;
    }
  }
  return -1;
}
#endif

// SysTick interrupt handler
void SysTick_Handler()
{
  // Handle virtual timers
  cmn_virtual_timer_cb();

  cmn_systimer_periodic();

  tickSeconds++;
  if(tickSeconds == SYSTICKHZ)
  {
    seconds_tick_pending = 1;
    tickSeconds = 0;
  }
  if(i2c_timeout_timer)
    i2c_timeout_timer--;
}

static void gTIMER0_enter_auto_reload_config(void)
{
  // ENABLE TIMER0 CLOCK
  SI32_CLKCTRL_A_enable_apb_to_modules_0(SI32_CLKCTRL_0,
    SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_ENABLED_U32);

  // INITIALIZE TIMER
  SI32_TIMER_A_initialize (SI32_TIMER_0, 0x00, 0x00, 0x00, 0x00);
  SI32_TIMER_A_select_single_timer_mode (SI32_TIMER_0);
  SI32_TIMER_A_select_high_clock_source_apb_clock (SI32_TIMER_0);
  SI32_TIMER_A_select_high_auto_reload_mode (SI32_TIMER_0);

  // Set overflow frequency to SYSTICKHZ
  SI32_TIMER_A_write_capture (SI32_TIMER_0, (unsigned) -(cmsis_get_cpu_frequency()/SYSTICKHZ));
  SI32_TIMER_A_write_count (SI32_TIMER_0, (unsigned) -(cmsis_get_cpu_frequency()/SYSTICKHZ));

  // Run Timer
  SI32_TIMER_A_start_high_timer(SI32_TIMER_0);

  // ENABLE INTERRUPTS
  NVIC_ClearPendingIRQ(TIMER0H_IRQn);
  NVIC_EnableIRQ(TIMER0H_IRQn);
  SI32_TIMER_A_enable_high_overflow_interrupt(SI32_TIMER_0);
}

static void gTIMER1_enter_auto_reload_config(void)
{
  // ENABLE TIMER1 CLOCK
  SI32_CLKCTRL_A_enable_apb_to_modules_0(SI32_CLKCTRL_0,
    SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_ENABLED_U32);

  // INITIALIZE TIMER
  SI32_TIMER_A_initialize (SI32_TIMER_1, 0x00, 0x00, 0x00, 0x00);
  SI32_TIMER_A_select_single_timer_mode (SI32_TIMER_1);
  SI32_TIMER_A_select_high_clock_source_apb_clock (SI32_TIMER_1);
  SI32_TIMER_A_select_high_auto_reload_mode (SI32_TIMER_1);

  // Set overflow frequency to SYSTICKHZ
#if defined(PCB_V10) //New versions use PWM and use this timer for processing uart data
  SI32_TIMER_A_write_capture (SI32_TIMER_1, (unsigned) -(cmsis_get_cpu_frequency()/TIMER1_HZ));
  SI32_TIMER_A_write_count (SI32_TIMER_1, (unsigned) -(cmsis_get_cpu_frequency()/TIMER1_HZ));
#else //Older PCB's have to use a high resolution timer for LED driving
  SI32_TIMER_A_write_capture (SI32_TIMER_1, (unsigned) -(cmsis_get_cpu_frequency()/LEDTICKHZ));
  SI32_TIMER_A_write_count (SI32_TIMER_1, (unsigned) -(cmsis_get_cpu_frequency()/LEDTICKHZ));
#endif

  // Run Timer
  SI32_TIMER_A_start_high_timer(SI32_TIMER_1);

  // ENABLE INTERRUPTS
  NVIC_ClearPendingIRQ(TIMER1H_IRQn);
  NVIC_EnableIRQ(TIMER1H_IRQn);
  SI32_TIMER_A_enable_high_overflow_interrupt(SI32_TIMER_1);
}

// ****************************************************************************
// PIO section


void pios_init( void )
{
#if defined( ELUA_BOARD_GSATMICRO_V10 ) || defined( ELUA_BOARD_GSATMICRO_V8 ) || defined( ELUA_BOARD_GSATMICRO_V7 )
  // SI32_PBCFG_A_unlock_ports(SI32_PBCFG_0);

  // // PB0 Setup
  // SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_0, 0x0603);
  // SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_0, 0x1114);
  // SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_0, 0x37FB);

  // // PB1 Setup
  // SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_1, 0x00A1);
  // SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_1, 0xFC1C);

  // // Enable Crossbar0 signals & set properties
  // SI32_PBCFG_A_enable_xbar0h_peripherals(SI32_PBCFG_0,
  //                                        SI32_PBCFG_A_XBAR0H_UART0EN |
  //                                        SI32_PBCFG_A_XBAR0H_UART1EN);
  // SI32_PBCFG_A_enable_xbar0l_peripherals(SI32_PBCFG_0,
  //                                        SI32_PBCFG_A_XBAR0L_USART0EN |
  //                                        SI32_PBCFG_A_XBAR0L_I2C0EN);
  // SI32_PBCFG_A_enable_crossbar_0(SI32_PBCFG_0);

  // // PB2 Setup
  // SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_2, 0x7FFF);

  // // PB3 Setup
  // SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_3, 0x00FF);

  // // Enable Crossbar1 signals & set properties
  // SI32_PBCFG_A_enable_crossbar_1(SI32_PBCFG_0);




  SI32_PBCFG_A_unlock_ports(SI32_PBCFG_0);

#if defined( ELUA_BOARD_GSATMICRO_V10 )
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_0, 0x0003);
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_0, 0x3F54);

  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_0, 0x0003);
  //JEFF TEST TO ENABLE PWM CHANNELS  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_0, 0x3F03);
  //Attach PWM pins to crossbar signal
  SI32_PBCFG_A_enable_xbar0_signal(SI32_PBCFG_0, SI32_XBAR0_EPCA0_CEX0_5);
#else
  // PB0 Setup
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_0, 0x0603);
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_0, 0x1514);
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_0, 0x03F3);
#endif
  // PB1 Setup
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_1, 0x07A1);
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_1, 0xFC1C);

#if defined( BLUETOOTH_ENABLE_TDI_DTR )
  SI32_PBSTD_A_set_pins_digital_input( SI32_PBSTD_1, 1 << 4 );
#endif

#if defined( BLUETOOTH_ENABLE_TDO_DSR )
  SI32_PBCFG_A_disable_jtag(SI32_PBCFG_0);
  SI32_PBSTD_A_set_pins_push_pull_output( SI32_PBSTD_1, 1 << 3 );
  SI32_PBSTD_A_write_pins_high(SI32_PBSTD_1, 1 << 3 );

  //Crank up power on bluetooth enable pin
  SI32_PBSTD_A_set_pins_high_drive_strength( SI32_PBSTD_1, 1 << 7 );
#endif

  // Analog Pins (1.14 & 1.15)
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_1, 0xC000);
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_1, 0xC000);

#if !defined( PCB_V7 ) && !defined( PCB_V8 ) && !defined( PCB_V10 )
  SI32_PBSTD_A_write_pins_low(SI32_PBSTD_1, 0x0200 ); //Set 5V regulator off
#endif
  SI32_PBSTD_A_write_pins_high(SI32_PBSTD_1, 0x0100 ); //Set USB high power mode

#if defined( PCB_V7 )
  SI32_PBSTD_A_write_pins_low(SI32_PBSTD_2, 0x03E0 ); //Set external LEDS 0-4 off
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_2, 0x03E0); //Set external LEDS 0-4 as outputs
#endif

#if defined( PCB_V8 ) 
  SI32_PBSTD_A_write_pins_low(SI32_PBSTD_0, 0x3F0 ); //Set external LEDS 0-4 off
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_0, 0x3F0); //Set external LEDS 0-4 as outputs
#endif

#if defined( PCB_V10 )
  SI32_PBSTD_A_write_pins_low(SI32_PBSTD_0, 0x3FF0);
  SI32_PBSTD_A_set_pins_push_pull_output( SI32_PBSTD_1, 1 << 10);
  SI32_PBSTD_A_write_pins_low( SI32_PBSTD_1, 1 << 10 );
#endif

