darren1713/elua/src/platform/sim3u1xx/platform.c
  // Enable Crossbar0 signals & set properties
  SI32_PBCFG_A_enable_xbar0l_peripherals(SI32_PBCFG_0,
                                         SI32_PBCFG_A_XBAR0L_USART0EN |
                                         SI32_PBCFG_A_XBAR0L_USART1EN |
                                         SI32_PBCFG_A_XBAR0L_USART1FCEN |
                                         SI32_PBCFG_A_XBAR0L_I2C0EN);
  SI32_PBCFG_A_enable_xbar0h_peripherals(SI32_PBCFG_0,
                                         SI32_PBCFG_A_XBAR0H_UART0EN |
                                         SI32_PBCFG_A_XBAR0H_UART1EN);
  SI32_PBCFG_A_enable_crossbar_0(SI32_PBCFG_0);

  // PB2 Setup
#if defined(BUILD_SPI1)
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_2, 0x003F);
#else
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_2, 0xFFFF);
#endif

  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_2 );

  // PB3 Setup
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_3, 0xFFFF);

  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_3 );


  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_1 );

#if defined( PCB_V7 ) || defined( PCB_V8 ) || defined( PCB_V10 )
  //PB3.8 is high voltage dc detection
  //PB3.9 is usb voltage detection
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_3, 0x00000300);
  //PB3.11 5V on/off

  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_3, ( u32 ) 1 << 11);
#if defined( PCB_V8 ) || defined( PCB_V10 )
  SI32_PBSTD_A_write_pins_low(SI32_PBSTD_3, ( u32 ) 1 << 11 ); //Set 5V regulator off
#else
  SI32_PBSTD_A_write_pins_high(SI32_PBSTD_3, ( u32 ) 1 << 11 ); //Set 5V regulator off
#endif
  // PB2.1 is wakeup
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_2, 0x00000002);
#else
  //PB3.6 is external input 1
  //PB3.7 is high voltage dc detection
  //PB3.8 is usb voltage detection
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_3, 0x000001C0);
  //PB3.11 is RS232 Force Off
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_3, ( u32 ) 1 << 11);
  SI32_PBSTD_A_write_pins_high(SI32_PBSTD_3, ( u32 ) 1 << 11 );
  //PB0.10 is RS232 VCC
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_0, ( u32 ) 1 << 10);
  SI32_PBSTD_A_write_pins_high(SI32_PBSTD_0, ( u32 ) 1 << 10 );
#endif

  //PB0.1 is external input 2
  //PB0.0 is accel INT1
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_0, 0x00000003);
  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_0 );

#if defined(BUILD_SPI1)
  SI32_PBCFG_A_enable_xbar1_peripherals(SI32_PBCFG_0, SI32_PBCFG_A_XBAR1_SPI1EN);
#endif

  // Enable Crossbar1 signals & set properties
  SI32_PBCFG_A_enable_crossbar_1(SI32_PBCFG_0);

  // Setup PBHD4
  SI32_PBCFG_A_unlock_ports(SI32_PBCFG_0);
  SI32_PBHD_A_write_pblock(SI32_PBHD_4, 0x00);

  SI32_PBHD_A_select_pin0_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin1_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin2_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin3_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin4_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin5_safe_state(SI32_PBHD_4, 0x0);

  SI32_PBHD_A_enable_bias(SI32_PBHD_4);
  SI32_PBHD_A_select_normal_power_port_mode(SI32_PBHD_4);
  SI32_PBHD_A_enable_drivers(SI32_PBHD_4);

  //Setup PB4.0/4.1 to outputs, no pullups, and low for MOSFET outputs
  //Setup PB4.3 LED0/1
  //Setup PB4.4/4.5 GPS
  //Setup PB4.2 to HIGH to turn on mosfets for bat charger!
  SI32_PBHD_A_set_pins_push_pull_output( SI32_PBHD_4, 0x003F );
  SI32_PBHD_A_disable_pullup_resistors( SI32_PBHD_4 );
  if( rram_read_bit( RRAM_BIT_GPS_HIBERNATE_WHILE_SLEEPING ) == GPS_HIBERNATE_WHILE_SLEEPING_ACTIVE )
    SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x1B );
  else
    SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x3B );

  SI32_PBHD_A_set_pins_low_drive_strength(SI32_PBHD_4, 0x3F);

  //SI32_PBHD_A_select_nchannel_current_limit(SI32_PBHD_4, 0xA);
  SI32_PBHD_A_select_pchannel_current_limit(SI32_PBHD_4, 0xF);
  SI32_PBHD_A_enable_pin_current_limit( SI32_PBHD_4, 0x3F );

  SI32_PBHD_A_select_slew_rate(SI32_PBHD_4, SI32_PBHD_A_SLEW_FASTEST);

#if defined( PCB_V7 ) || defined( PCB_V8 ) || defined( PCB_V10 )
#if defined( PCB_V7_CHARGER_NPN ) || defined( PCB_V8 ) || defined( PCB_V10 )
  //PB4.2 charger disconnect needs to be set high to enable NPN
  SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x04 );
#else
  //PB4.2 charger disconnect needs to be set low to enable MOSFET
  SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x04 );
#endif
#endif

// #if defined( PCB_V7 ) || defined( PCB_V8 )
//   // PB4.4 high to power RS232 and I2C
//   SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x10 );
//   // PB4.4 high to power RS232 and I2C
//   SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x10 );
// #endif

  // SI32_PBHD_A_select_pchannel_current_limit(SI32_PBHD_4, 0);
  // SI32_PBHD_A_enable_pin_current_limit( SI32_PBHD_4, 0x3F );

  // SI32_PBHD_A_write_pblock(SI32_PBHD_4, 0x0000);
  // SI32_PBHD_A_enable_drivers(SI32_PBHD_4);
  // SI32_PBHD_A_select_pchannel_current_limit(SI32_PBHD_4, 15);
  // SI32_PBHD_A_select_nchannel_current_limit(SI32_PBHD_4, 15);
  // SI32_PBHD_A_set_pins_push_pull_output(SI32_PBHD_4, 0x003F);
  // SI32_PBHD_A_set_pins_high_drive_strength(SI32_PBHD_4, 0x003F);
  // SI32_PBHD_A_enable_n_channel_drivers(SI32_PBHD_4, 0x003F);
  // SI32_PBHD_A_enable_p_channel_drivers(SI32_PBHD_4, 0x003F);
  // SI32_PBHD_A_enable_pin_current_limit(SI32_PBHD_4, 0x003F);
  //Enable blue LED's if we are on or just in a PM9 temporary sleep...
  if(rram_read_bit(RRAM_BIT_POWEROFF) == POWEROFF_MODE_ACTIVE)
  {
#if defined(  PCB_V7 ) || defined( PCB_V8 ) || defined( PCB_V10 )
  #if defined( PCB_V10)
    SI32_PBSTD_A_write_pins_low( SI32_PBSTD_0, 0x100 );
  #elif defined( PCB_V8 ) 
    SI32_PBSTD_A_write_pins_low( SI32_PBSTD_0, 0x10 );
  #else
    SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x08 );
  #endif
#else
  #ifndef USE_EXTERNAL_MOSFETS
      SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x02 );
  #endif
      SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x08 );
#endif
  }
  else
  {
#if defined( PCB_V7 ) || defined( PCB_V8 ) || defined( PCB_V10 )
  #if defined( PCB_V10 )
    SI32_PBSTD_A_write_pins_high( SI32_PBSTD_0, 0x100 );
  #elif defined( PCB_V8 )
    SI32_PBSTD_A_write_pins_high( SI32_PBSTD_0, 0x10 );
  #else
    SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x08 );
  #endif
#else
  #ifndef USE_EXTERNAL_MOSFETS
      SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x02 );
  #endif
      SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x08 );
#endif
  }

#else //#if defined( ELUA_BOARD_GSATMICRO_V8 ) || defined( ELUA_BOARD_GSATMICRO_V7 )
  // Set up prinf pin
  //SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_1, 0x00000008);

  SI32_PBCFG_A_enable_crossbar_1(SI32_PBCFG_0);
  SI32_PBCFG_A_enable_crossbar_0(SI32_PBCFG_0);

  // ENABLE LED DRIVERS (P2.11, P2.10)
  //SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_2, 0x00000C00);

  // Enable switch sensing (P2.10, P2.11)
  //SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_2, 0x00000300);

  // UART PINS TO PROPER CONFIG (TX = PB1.12, RX = PB1.13)
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_1, 0x0001000);
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_1, 0x00002000);
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_0, 0x0000FFFF);
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_1, 0x00000FFF);

  // BRING OUT UART
  SI32_PBCFG_A_enable_xbar0h_peripherals(SI32_PBCFG_0, SI32_PBCFG_A_XBAR0H_UART0EN);
#endif
}


// The platform I/O functions
pio_type platform_pio_op( unsigned port, pio_type pinmask, int op )
{
  pio_type retval = 1;

  switch( op )
  {
    case PLATFORM_IO_PORT_SET_VALUE:
      if( port < 4)
        SI32_PBSTD_A_write_pins_masked( port_std[ port ], 0xFFFF, pinmask);
      else
        SI32_PBHD_A_write_pins_masked( SI32_PBHD_4, 0xFFFF, pinmask);
      break;

    case PLATFORM_IO_PIN_SET:
      if( port < 4)
        SI32_PBSTD_A_write_pins_high( port_std[ port ], pinmask );
      else
        SI32_PBHD_A_write_pins_high( SI32_PBHD_4, pinmask );
      break;

    case PLATFORM_IO_PIN_CLEAR:
      if( port < 4)
        SI32_PBSTD_A_write_pins_low( port_std[ port ], pinmask );
      else
        SI32_PBHD_A_write_pins_low( SI32_PBHD_4, pinmask );
      break;

    case PLATFORM_IO_PORT_DIR_OUTPUT:
      if( port < 4 )
        SI32_PBSTD_A_set_pins_push_pull_output( port_std[ port ], 0xFFFF );
      else
        SI32_PBHD_A_set_pins_push_pull_output( SI32_PBHD_4, 0xFFFF );
        //SI32_PBHD_A_enable_p_channel_drivers( SI32_PBHD_4, 0xFFFF );
      break;

    case PLATFORM_IO_PIN_DIR_OUTPUT:
      if( port < 4 )
        SI32_PBSTD_A_set_pins_push_pull_output( port_std[ port ], pinmask );
      else
        SI32_PBHD_A_set_pins_push_pull_output( SI32_PBHD_4, pinmask );
        //SI32_PBHD_A_enable_p_channel_drivers( SI32_PBHD_4, pinmask );
      break;

    case PLATFORM_IO_PORT_DIR_INPUT:
      if( port < 4 )
        SI32_PBSTD_A_set_pins_digital_input( port_std[ port ], 0xFFFF );
      else
        SI32_PBHD_A_set_pins_digital_input( SI32_PBHD_4, 0xFFFF );
      break;

