darren1713/elua/src/platform/sim3u1xx/platform.c
    // Only attempt to refresh sequence order if still running
    // This allows us to "cache" an old sequence if all channels
    // finish at the same time
    if ( d->running == 1 )
      adc_update_dev_sequence( 0 );

    if ( d->clocked == 0 && d->running == 1 )
    {
      SI32_SARADC_A_enable_burst_mode(SI32_ADC);
      SI32_SARADC_A_enable_autoscan(SI32_ADC);

      // a 1-to-0 transition on ACCMD bit will enable the accumulator for the next conversion
      SI32_SARADC_A_enable_accumulator(SI32_ADC);
      SI32_SARADC_A_clear_accumulator(SI32_ADC);
      SI32_SARADC_A_start_conversion( SI32_ADC );
    }
  }
  else if ( SI32_SARADC_A_is_single_conversion_complete_interrupt_pending( SI32_ADC ) )
  {
    SI32_SARADC_A_clear_single_conversion_complete_interrupt( SI32_ADC );
    SI32_SARADC_A_enable_burst_mode( SI32_ADC );
    SI32_SARADC_A_start_conversion( SI32_ADC );
    //printf("Single\n");
  }
}

#define ADC_CLK 1000000

static void adcs_init()
{
  unsigned id;
  //elua_adc_dev_state *d = adc_get_dev_state( 0 );
  // Fclk_SAR = (2 x Fapb)/(sar_clk_div +1).
  SI32_SARADC_A_select_sar_clock_divider( SI32_ADC, ( div_round_closest( 2 * cmsis_get_cpu_frequency(), ADC_CLK )  - 1 ) );

  SI32_SARADC_A_select_output_packing_mode_lower_halfword_only( SI32_ADC );

  SI32_SARADC_A_select_start_of_conversion_source( SI32_ADC, SI32_SARADC_A_CONTROL_SCSEL_ADCNT0_VALUE );

  SI32_SARADC_A_select_burst_mode_clock_apb_clock( SI32_ADC );

  // adc will run through one scan of all enabled time sequences once
  SI32_SARADC_A_select_autoscan_mode_once( SI32_ADC );

  SI32_SARADC_A_enable_common_mode_buffer( SI32_ADC );

  SI32_SARADC_A_select_vref_internal( SI32_ADC );

  // Set up characteristic group 0
  SI32_SARADC_A_enter_12bit_mode(SI32_ADC, 0);

  SI32_SARADC_A_select_delayed_track_mode( SI32_ADC );

  SI32_SARADC_A_select_burst_mode_repeat_count(SI32_ADC, 0,
                                              SI32_SARADC_A_BURST_MODE_REPEAT_COUNT_SAMPLE_16_TIMES);

  SI32_SARADC_A_select_channel_character_group_gain_half( SI32_ADC, 0 );
  //SI32_SARADC_A_select_channel_character_group_gain_one( SI32_ADC, 0 );


  for( id = 0; id < NUM_ADC; id ++ )
    adc_init_ch_state( id );

  // Perform sequencer setup
  platform_adc_set_clock( 0, 0 );

  NVIC_ClearPendingIRQ(SI32_ADC_IRQ);
  NVIC_EnableIRQ(SI32_ADC_IRQ);

  SI32_SARADC_A_enable_single_conversion_complete_interrupt(SI32_ADC);
  SI32_SARADC_A_enable_scan_done_interrupt(SI32_ADC);

  // Enable VREGIN ADC source
  SI32_VREG_A_enable_vreg_sense(SI32_VREG_0);
}

u32 platform_adc_set_clock( unsigned id, u32 frequency )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );

  // if ( frequency > 0 )
  // {
  //   //d->clocked = 1;
  //   // not yet implemented
  // }
  // else
  // {
    d->clocked = 0;
    // Conversion will run back-to-back until required samples are acquired
    SI32_SARADC_A_select_start_of_conversion_source( SI32_ADC, SI32_SARADC_A_CONTROL_SCSEL_ADCNT0_VALUE );
  // }

  return frequency;
}


int platform_adc_update_sequence( )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );

  SI32_SARADC_A_disable_module(SI32_ADC);

  // NOTE: seq ctr should have an incrementer that will wrap appropriately..
  d->seq_ctr = 0;
  while( d->seq_ctr < d->seq_len )
  {

    SI32_SARADC_A_select_timeslot_channel( SI32_ADC, d->seq_ctr,
                                           adc_ctls[ d->ch_state[ d->seq_ctr ]->id ] );

    SI32_SARADC_A_select_timeslot_channel_character_group( SI32_ADC, d->seq_ctr, 0 );
    d->seq_ctr++;
  }
  // Set sequence end
  SI32_SARADC_A_select_timeslot_channel( SI32_ADC, d->seq_ctr, 31 );
  d->seq_ctr = 0;


  // // ENABLE MODULE
  SI32_SARADC_A_enable_module(SI32_ADC);

  return PLATFORM_OK;
}


int platform_adc_start_sequence()
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );

  if( d->running != 1 )
  {
    adc_update_dev_sequence( 0 );

    SI32_SARADC_A_enable_burst_mode(SI32_ADC);

    // a 0-to-1 transition on the SCANEN bit is required to arm the scan.
    // the scan will not start until a conversion start occurs.
    SI32_SARADC_A_enable_autoscan(SI32_ADC);

    // a 1-to-0 transition on ACCMD bit will enable the accumulator for the next conversion
    SI32_SARADC_A_enable_accumulator(SI32_ADC);
    SI32_SARADC_A_clear_accumulator(SI32_ADC);

    d->running = 1;

    if( d->clocked == 1 )
    {
      // not yet implemented
    }
    else
    {
      SI32_SARADC_A_start_conversion( SI32_ADC );
    }
  }

  return PLATFORM_OK;
}

#endif // ifdef BUILD_ADC

// ****************************************************************************
// I2C support

#if NUM_I2C > 0

//#define DEBUG_I2C

int i2c_reset_pending = 0;

static SI32_I2C_A_Type* const i2cs[] = { SI32_I2C_0, SI32_I2C_1 };

#define  I2C_WRITE          0x00           // I2C WRITE command
#define  I2C_READ           0x01           // I2C READ command

u32 platform_i2c_setup( unsigned id, u32 speed )
{
  u32 i2c_clock = cmsis_get_cpu_frequency();
  u32 scl_timer_bytes = ( ( 1 << 20 ) - ( ( 25 * i2c_clock ) / 1000 ) ) / 16;
  u32 i2c_clock_per_cycle = ( ( ( i2c_clock / 2 + ( speed - 1 ) ) / speed ) );

  if( i2c_reset_pending )
  {
    printf("i2c: reset\n");
    SI32_I2C_A_reset_module( i2cs[ id ] );
    i2c_reset_pending = 0;
  }

  SI32_I2C_A_set_scaler_value( i2cs[ id ], 0x3F );

  SI32_I2C_A_set_scl_low_period_reload( i2cs[ id ], 256 - i2c_clock_per_cycle );
  SI32_I2C_A_set_timer1_reload( i2cs[ id ], 256 - i2c_clock_per_cycle );

  // // configure bus free timeouts
  // SI32_I2C_A_set_timer0_u8 ( i2cs[ id ] , 0x00);
  // SI32_I2C_A_set_timer0_reload ( i2cs[ id ] , 0x01);

  // set SETUP time to non-zero value for repeated starts to function correctly
  SI32_I2C_A_set_extended_data_setup_time( i2cs[ id ] , 0x01 );

  // Configure SCL low timeouts (25 ms)
  SI32_I2C_A_set_timer2_reload( i2cs[ id ], scl_timer_bytes & 0xFF );
  SI32_I2C_A_set_timer3_reload( i2cs[ id ], ( scl_timer_bytes >> 8 ) & 0xFF );

  // ENABLE MODULE
  SI32_I2C_A_enable_module( i2cs[ id ] );

  NVIC_ClearPendingIRQ( I2C0_IRQn );
  NVIC_EnableIRQ( I2C0_IRQn );

  SI32_I2C_A_enable_timer3_interrupt( i2cs[ id ] );
  SI32_I2C_A_enable_arblost_interrupt( i2cs[ id ] );

  // Return actual speed
  return i2c_clock / ( ( i2c_clock_per_cycle ) * 2 );
}

