darren1713/elua/src/platform/sim3u1xx/platform.c
void platform_i2c_send_start( unsigned id )
{
  // The master write operation starts with firmware setting the STA
  // bit to generate a start condition.

/* This is all moved to the 'platform_i2c_send_address' function because we have to generate and detect a start so do it all at once. This is required for us to work in I2C slave mode properly
  SI32_I2C_A_set_start( i2cs[ id ] );

  if( SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) )
    SI32_I2C_A_clear_tx_interrupt ( i2cs[ id ] );

  if( SI32_I2C_A_is_rx_interrupt_pending( i2cs[ id ] ) )
    SI32_I2C_A_clear_rx_interrupt ( i2cs[ id ] );

  i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

  while( SI32_I2C_A_is_start_interrupt_pending( i2cs[ id ] ) == 0 &&
         i2c_timeout_timer );

  if( !SI32_I2C_A_is_start_interrupt_pending( i2cs[ id ] ) )
  {
#if defined( DEBUG_I2C )
    printf("BEG TIMEOUT\n");
#endif
    return;
  }
#if defined( DEBUG_I2C )
  printf("BEG CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif
*/
}

void platform_i2c_send_stop( unsigned id )
{
  if ( SI32_I2C_A_is_busy( i2cs[ id ] ) )
  {
#if defined( DEBUG_I2C )
    printf("END CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif

    if( SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) )
      SI32_I2C_A_clear_tx_interrupt ( i2cs[ id ] );

    if( SI32_I2C_A_is_rx_interrupt_pending( i2cs[ id ] ) )
      SI32_I2C_A_clear_rx_interrupt ( i2cs[ id ] );

    SI32_I2C_A_set_stop( i2cs[ id ] );
#if defined( DEBUG_I2C )
    printf("END CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif

    i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

    while( SI32_I2C_A_is_stop_interrupt_pending( i2cs[ id ] ) == 0 &&
      i2c_timeout_timer );

    if( !SI32_I2C_A_is_stop_interrupt_pending( i2cs[ id ] ) )
      return;

    SI32_I2C_A_clear_stop( i2cs[ id ] );
    SI32_I2C_A_send_nack ( i2cs[ id ] );
    SI32_I2C_A_clear_stop_interrupt( i2cs[ id ] );
#if defined( DEBUG_I2C )
    printf("END CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif
  }
  else
  {
#if defined( DEBUG_I2C )
    printf("send_stop: not active\n");
#endif
    i2c_reset_pending = 1;
  }
}

int platform_i2c_send_address( unsigned id, u16 address, int direction )
{
  // The master write operation starts with firmware setting the STA
  // bit to generate a start condition.
#if defined(BUILD_I2C_SLAVE) //Disable start interrupt as we need to detect in inline below...
  SI32_I2C_A_disable_start_interrupt( i2cs[ id ] );
#endif

  SI32_I2C_A_set_start( i2cs[ id ] );

  if( SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) )
    SI32_I2C_A_clear_tx_interrupt ( i2cs[ id ] );

  if( SI32_I2C_A_is_rx_interrupt_pending( i2cs[ id ] ) )
    SI32_I2C_A_clear_rx_interrupt ( i2cs[ id ] );

  i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

  while( SI32_I2C_A_is_start_interrupt_pending( i2cs[ id ] ) == 0 &&
         i2c_timeout_timer );

  if( !SI32_I2C_A_is_start_interrupt_pending( i2cs[ id ] ) )
  {
#if defined( DEBUG_I2C )
    printf("BEG TIMEOUT\n");
#endif
#if defined(BUILD_I2C_SLAVE) //Disable start interrupt as we need to detect in inline below...
    SI32_I2C_A_enable_start_interrupt( i2cs[ id ] );
#endif
    return 0;
  }
#if defined( DEBUG_I2C )
  printf("BEG CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif


  u8 acktmp = 0;
  // The ISR or firmware routine should then clear the start bit (STA),
  // set the targeted slave address and the R/W direction bit in the DATA
  // register, set the byte count, arm the transmission (TXARM = 1), and
  // clear the start interrupt.
  if ( SI32_I2C_A_is_busy( i2cs[ id ] ) )
  {
#if defined( DEBUG_I2C )
    printf("A CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif

    i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

    while( SI32_I2C_A_is_start_interrupt_pending( i2cs[ id ] ) == 0 &&
      i2c_timeout_timer );

    if( !SI32_I2C_A_is_start_interrupt_pending( i2cs[ id ] ) )
    {
#if defined( DEBUG_I2C )
      printf("I2C TIMEOUT\n");
#endif
#if defined(BUILD_I2C_SLAVE) //Disable start interrupt as we need to detect in inline below...
      SI32_I2C_A_enable_start_interrupt( i2cs[ id ] );
#endif
      return 0;
    }

    SI32_I2C_A_clear_start( i2cs[ id ] );
    SI32_I2C_A_set_byte_count( i2cs[ id ] , 1);
    SI32_I2C_A_write_data( i2cs[ id ] , ( address << 1 ) | (direction == PLATFORM_I2C_DIRECTION_TRANSMITTER ?  I2C_WRITE : I2C_READ) );
    SI32_I2C_A_arm_tx( i2cs[ id ] );
    SI32_I2C_A_clear_start_interrupt( i2cs[ id ] );

    i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

    while( SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) == 0 &&
      i2c_timeout_timer );

    if( !SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) )
    {
#if defined( DEBUG_I2C )
      printf("I2C TIMEOUT2\n");
#endif
#if defined(BUILD_I2C_SLAVE) //Disable start interrupt as we need to detect in inline below...
      SI32_I2C_A_enable_start_interrupt( i2cs[ id ] );
#endif
      return 0;
    }

    acktmp = ( u8 )SI32_I2C_A_is_ack_received( i2cs[ id ] );

    SI32_I2C_A_clear_ack_interrupt( i2cs[ id ] );
    SI32_I2C_A_clear_tx_interrupt( i2cs[ id ] );
    
#if defined( DEBUG_I2C )
    printf("A CONTROL = %lx %d\n",  i2cs[ id ]->CONTROL.U32, acktmp );
#endif
  }
  else
  {
    //#if defined( DEBUG_I2C )
    printf("send_addr: not active\n");
    i2c_reset_pending = 1;
    //#endif
  }
#if defined(BUILD_I2C_SLAVE) //Disable start interrupt as we need to detect in inline below...
  SI32_I2C_A_enable_start_interrupt( i2cs[ id ] );
#endif

  return acktmp;
}

int platform_i2c_send_byte( unsigned id, u8 data )
{
  if ( SI32_I2C_A_is_busy( i2cs[ id ] ) )
  {
#if defined( DEBUG_I2C )
    printf("B CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif
    u32 tmpdata = ( u32 )data;
    SI32_I2C_A_set_byte_count( i2cs[ id ] , 1 );
    SI32_I2C_A_write_data( i2cs[ id ], tmpdata );
    SI32_I2C_A_arm_tx( i2cs[ id ] );
    SI32_I2C_A_clear_tx_interrupt( i2cs[ id ] );

    i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

    while( SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) == 0 &&
      i2c_timeout_timer );

    if( !SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) )
      return 0;

    SI32_I2C_A_clear_ack_interrupt( i2cs[ id ] );

