darren1713/elua/src/platform/sim3u1xx/platform.c
  //Set 5V pin to analog high...
  SI32_PBSTD_A_set_pins_push_pull_output( SI32_PBSTD_1, 0x00000200);
  SI32_PBSTD_A_write_pins_low( SI32_PBSTD_1, 0x0200 );

#if defined( PCB_V7 ) || defined( PCB_V8 ) || defined( PCB_V10 )
  SI32_PBSTD_A_set_pins_digital_input( SI32_PBSTD_2, 0x0002 );
  SI32_PBSTD_A_set_pins_digital_input( SI32_PBSTD_3, 1 << 9 );
#endif

  SI32_PBHD_A_set_pins_push_pull_output( SI32_PBHD_4, 0x00 );
  SI32_PBHD_A_set_pins_low_drive_strength(SI32_PBHD_4, 0x3F);
  SI32_PBHD_A_disable_bias( SI32_PBHD_4 );
  SI32_PBHD_A_disable_pin_current_limit( SI32_PBHD_4, 0x3F );
  SI32_PBHD_A_set_pins_digital_input( SI32_PBHD_4, 0x3F );
  SI32_PBHD_A_disable_pullup_resistors( SI32_PBHD_4 );

  if( ( rram_read_bit( RRAM_BIT_GPS_HIBERNATE_WHILE_SLEEPING ) == GPS_HIBERNATE_WHILE_SLEEPING_ACTIVE ) &&
      ( rram_read_bit( RRAM_BIT_STORAGE_MODE ) == STORAGE_MODE_DISABLED ) &&
      ( rram_read_bit( RRAM_BIT_TEMP_STORAGE_MODE ) == TEMP_STORAGE_MODE_DISABLED ) &&
      ( rram_read_bit( RRAM_BIT_POWEROFF ) == POWEROFF_MODE_DISABLED ) )
  {
    SI32_PBHD_A_set_pins_push_pull_output( SI32_PBHD_4, 0x20 );
    SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x1F );
    SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x20 );
  }
  else
  {
    rram_write_bit(RRAM_BIT_GPS_HIBERNATE_WHILE_SLEEPING, GPS_HIBERNATE_WHILE_SLEEPING_DISABLED);
    SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x3F );
  }


#if defined( PCB_V7 ) || defined( PCB_V8 ) || defined( PCB_V10 )
#if defined( PCB_V7_CHARGER_NPN ) || defined( PCB_V8 ) || defined( PCB_V10 )
  //PB4.2 is set low above which disables the NPN so do nothing
#else
  //PB4.2 Set the disconnect mosfets to high!
  SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x04 );
  SI32_PBHD_A_set_pins_analog( SI32_PBHD_4, 0x04 );
#endif

  //JEFF TESTING with R21 shorted and 150uA to VCC
  SI32_PBSTD_A_write_pins_high( SI32_PBSTD_3, 0x0800 );
  SI32_PBSTD_A_set_pins_digital_input( SI32_PBSTD_3, 0x00000800);
#endif
}



void sim3_pmu_pm9( int seconds )
{
  //u8 i;
  led_set_mode(LED_COLOR_PWR, LED_FADEDOWN, 10);
  led_set_mode(LED_COLOR_GPS, LED_OFF, 255 );
  led_set_mode(LED_COLOR_SAT, LED_OFF, 255 );

  if( seconds != TRICK_TO_REBOOT_WITHOUT_DFU_MODE )
  {
    if( seconds <= 0 )
    {
      seconds = 1;
    }

    if( ( external_power() && 
        ( ( rram_read_bit(RRAM_BIT_SLEEP_WHEN_POWERED) == SLEEP_WHEN_POWERED_DISABLED ) || usb_power() ) ) ||
        ( ( rram_read_bit( RRAM_BIT_SLEEP_WITH_BATTERY ) == SLEEP_WITH_BATTERY_DISABLED ) && ( bat_abovethresh() > 0 ) ) )
    {
      wake_reason = WAKE_POWERCONNECTED;

      rram_write_int(RRAM_INT_SLEEPTIME, seconds);

      return;
    }
    else if( ( lua_command_pending() || c_command_pending() || extras_op_pending() ) && !pending_op_used )
    {
      wake_reason = WAKE_PENDINGOP;

      pending_op_timeout = 70;
      pending_op_used = 1;

      rram_write_int(RRAM_INT_SLEEPTIME, seconds);

      return;
    }
    else if( bluetooth_connected() )
    {
      wake_reason = WAKE_BLUETOOTH;

      rram_write_int(RRAM_INT_SLEEPTIME, seconds);

      return;
    }
    else if( external_buttons() )
    {
      wake_reason = WAKE_WAKEPIN;

      rram_write_int(RRAM_INT_SLEEPTIME, seconds);

      return;
    }
    else if( external_io() )
    {
      wake_reason = WAKE_IO;

      rram_write_int(RRAM_INT_SLEEPTIME, seconds);

      return;
    }
  }
  else
    seconds = 1;

  // GET CURRENT TIMER VALUE INTO SETCAP
  //SI32_RTC_A_start_timer_capture(SI32_RTC_0);
  //while(SI32_RTC_A_is_timer_capture_in_progress(SI32_RTC_0));

#ifdef EXTRA_SLEEP_HOOK
    extras_sleep_hook(PIN_CHECK_INTERVAL);
#endif

  // SET ALARM FOR now+s
  // RTC running at 16.384Khz so there are 16384 cycles/sec)
  // Don't permanently go into storage mode when on power
  if( ( rram_read_bit( RRAM_BIT_STORAGE_MODE ) == STORAGE_MODE_ACTIVE ) &&
      ( rram_read_bit( RRAM_BIT_CHECKIN ) == CHECKIN_MODE_DISABLED ) &&
      ( rram_read_bit( RRAM_BIT_ALERT ) == ALERT_MODE_DISABLED ) &&
      ( rram_read_bit( RRAM_BIT_ALERT_SINGLE ) == ALERT_MODE_SINGLE_DISABLED ) &&
      !external_power()  )
  {
    //Sleep forever, in storage mode. Power button will wakeup device
    rram_write_int(RRAM_INT_SLEEPTIME,  0);
    SI32_RTC_A_write_alarm0(SI32_RTC_0, 0xFFFFFFFF); //will wakeup in 3 days
  }
  else if( seconds > PIN_CHECK_INTERVAL )
  {
    rram_write_int(RRAM_INT_SLEEPTIME, seconds - PIN_CHECK_INTERVAL);
    SI32_RTC_A_write_alarm0(SI32_RTC_0, /*SI32_RTC_A_read_setcap(SI32_RTC_0) +*/ (platform_timer_op(0, PLATFORM_TIMER_OP_GET_CLOCK, 0) * PIN_CHECK_INTERVAL));
  }
  else
  {
    rram_write_int(RRAM_INT_SLEEPTIME, 0);
    SI32_RTC_A_write_alarm0(SI32_RTC_0, /*SI32_RTC_A_read_setcap(SI32_RTC_0) +*/ (platform_timer_op(0, PLATFORM_TIMER_OP_GET_CLOCK, 0) * seconds));
  }


  // Sleep if buttons pressed
  // Disable the SysTick timer to prevent these interrupts
  // from waking the core.
  SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;


  // Stop USB
  SI32_USB_A_reset_module( SI32_USB_0 );
  NVIC_DisableIRQ(USB0_IRQn);
  SI32_USB_A_disable_module(SI32_USB_0);
  SI32_USB_A_disable_internal_pull_up( SI32_USB_0 );

  // Enter Sleep Mode
  myPB_enter_off_config();

  //VMON0_enter_power_9_mode_from_normal_power_mode();
  SI32_VMON_A_disable_vdd_supply_monitor(SI32_VMON_0);

  //LDO0_enter_power_9_mode_from_normal_power_mode();
  SI32_LDO_A_disable_bias(SI32_LDO_0);
  SI32_LDO_A_select_low_bias(SI32_LDO_0);

  //VREG0_enter_power_9_mode_from_normal_power_mode();
  if(extras_minimum_sleep_power() <= LIGHT_LOAD_BETWEEN_20MA_TO_5MA)
    SI32_VREG_A_enter_suspend_mode(SI32_VREG_0);
  if(extras_minimum_sleep_power() == VERY_LIGHT_LOAD_UNDER_5MA)
    SI32_VREG_A_disable_band_gap(SI32_VREG_0);
  RSTSRC0_enter_power_9_mode_from_normal_power_mode();

  //Reset RTC Timer and clear any interrupts
  SI32_RTC_A_write_setcap(SI32_RTC_0, 0x0);
  SI32_RTC_A_start_timer_set(SI32_RTC_0);
  SI32_RTC_A_clear_alarm0_interrupt(SI32_RTC_0);
  SI32_RTC_A_clear_oscillator_fail_flag(SI32_RTC_0);
  while(SI32_RTC_A_is_timer_set_in_progress(SI32_RTC_0));

