darren1713/elua/src/platform/sim3u1xx/platform.c
int platform_flash_erase_sector( u32 sector_id )
{
  flash_key_mask = 0x01;
  return flash_erase( sector_id * INTERNAL_FLASH_SECTOR_SIZE + INTERNAL_FLASH_START_ADDRESS, 1) == 0 ? PLATFORM_OK : PLATFORM_ERR;
}

// ****************************************************************************
// USB functions

#if defined( BUILD_USB_CDC )

unsigned platform_get_console_uart( void )
{
  return CON_UART_ID;
}

void sim3_usb_cdc_send( u8 data )
{
  usb_pcb_t *pcb = usb_pcb_get();

  if (!(pcb->flags & (1<<ENUMERATED)))
  {
      return;
  }
  if(usb_buf_space(EP_1) == 0)
      return;

  if(usb_buf_write(EP_1, (U8)data) == 0)
    usb_poll();//ep_write(EP_1);
}

int sim3_usb_cdc_recv( s32 timeout )
{
  usb_pcb_t *pcb = usb_pcb_get();

  if (!(pcb->flags & (1<<ENUMERATED)))
      return -1;

  if(/*usb_buf_bytes(EP_3)*/pcb->fifo[EP_3].len > 0 )
    return usb_buf_read(EP_3);
  else
    return -1;
}

#endif




// ****************************************************************************
// Platform specific modules go here
// #ifdef PS_LIB_TABLE_NAME


// #define MIN_OPT_LEVEL 2
// #include "lrodefs.h"
// #ifdef ENABLE_PMU
// extern const LUA_REG_TYPE pmu_map[];
// #endif

// // #if defined( EXTRA_LIBS_INCLUDE )
// // #include "extra_libs.h"
// // #endif

// // #if defined( SIM3_EXTRA_LIBS_ROM ) && LUA_OPTIMIZE_MEMORY == 2
// // #define _EXTRAROM( name, openf, table ) extern const LUA_REG_TYPE table[];
// // SIM3_EXTRA_LIBS_ROM;
// // #endif

// const LUA_REG_TYPE platform_map[] =
// {
// //#if LUA_OPTIMIZE_MEMORY > 0
//   //{ LSTRKEY( "pmu" ), LROVAL( pmu_map ) },
// // #if defined(SIM3_EXTRA_LIBS_ROM)
// // #undef _EXTRAROM
// // #define _EXTRAROM( name, openf, table ) { LSTRKEY( #name ), LROVAL( table ) },
// //   SIM3_EXTRA_LIBS_ROM
// // #endif
// // #endif
//   { LNILKEY, LNILVAL }
// };

// LUALIB_API int luaopen_platform( lua_State *L )
// {
// #if LUA_OPTIMIZE_MEMORY > 0
//   return 0;
// #else // #if LUA_OPTIMIZE_MEMORY > 0
//   //Turn on aggressive emergency garbage collection
//   legc_set_mode( L, EGC_ALWAYS, 20);

//   luaL_register( L, PS_LIB_TABLE_NAME, platform_map );

//   // Setup the new tables inside platform table
//   // lua_newtable( L );
//   // luaL_register( L, NULL, pmu_map );
//   // lua_setfield( L, -2, "pmu" );

// #if defined( SIM3_EXTRA_LIBS_ROM )
// #undef _EXTRAROM
/* #define _EXTRAROM( name, openf, table ) \
//   lua_newtable( L ); \
//   luaL_register( L, NULL, table ); \
//   lua_setfield( L, -2, #name ); */
// #endif

//   return 1;
// #endif // #if LUA_OPTIMIZE_MEMORY > 0
// }

// #else // #ifdef ENABLE_PMU

// LUALIB_API int luaopen_platform( lua_State *L )
// {
//   return 0;
// }

// #endif // #ifdef ENABLE_PMU
